// Title: Shortest Distance to Target String in a Circular Array
            // Difficulty: Easy
            // Language: C++
            // Link: https://leetcode.com/problems/shortest-distance-to-target-string-in-a-circular-array/

class·‌Solution·‌{
public:
·‌·‌·‌·‌int·‌closestTarget(vector<string>&·‌words,·‌
string·‌target,·‌int·‌startIndex)·‌{
·‌·‌·‌·‌·‌·‌·‌·‌int·‌n·‌=·‌words.size();
·‌·‌·‌·‌·‌·‌·‌·‌int·‌ans·‌=·‌INT_MAX;

·‌·‌·‌·‌·‌·‌·‌·‌for(int·‌i·‌=·‌0;·‌i·‌<·‌n;·‌i++){
·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌if(words[i]·‌==·‌target){
·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌int·‌d·‌=·‌abs(i·‌-·‌startIndex);
·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌ans·‌=·‌min(ans,·‌min(d,·‌n·‌-·‌d));
·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌}
·‌·‌·‌·‌·‌·‌·‌·‌}

·‌·‌·‌·‌·‌·‌·‌·‌return·‌ans·‌==·‌INT_MAX·‌?·‌-1·‌:·‌ans;
·‌·‌·‌·‌}
};
